Revit 2027 API
GroupTypeId.Mechanical Property
 Mechanical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Mechanical { get; }
Public Shared ReadOnly Property Mechanical As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Mechanical {
	ForgeTypeId^ get ();
}
static member Mechanical : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace